app/controllers/comments_controller.rb

INSERT INTO "comments" ("comments", "movie_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comments", "hello"], ["movie_id", 16], ["user_id", 30], ["created_at", "2021-03-11 22:19:18.095020"], ["updated_at", "2021-03-11 22:19:18.095020"]]
---
    def create
        comment = Comment.create(comment_params)

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "comments" SET "comments" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["comments", "The Lion King is the best!!!"], ["updated_at", "2021-03-11 20:04:13.917204"], ["id", 2]]
---
    def update
        comment = Comment.find(params[:id])
        comment.update(comments: (params[:comments]))