app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        movie = Movie.find(params[:id])

INSERT INTO "movies" ("name", "release_date", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
    def create
        movie = Movie.create(movie_params)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
UPDATE "movies" SET "updated_at" = ?, "likes" = ? WHERE "movies"."id" = ?  [["updated_at", "2021-03-12 02:00:25.098790"], ["likes", 1], ["id", 30]]
---
    def update
        movie = Movie.find(params[:id])
        movie.update(likes: (params[:likes]))