app/controllers/users_controller.rb

    def create
        user = User.find_or_create_by(user_params)
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ""], ["created_at", "2021-03-11 21:53:22.460074"], ["updated_at", "2021-03-11 21:53:22.460074"]]